system/logs/payments/QW-25122013.log

########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:updateBill xmlns:ns2="http://client.ishop.mw.ru/"><login>16801</login><password>2E742DEF88615F020FD184B031600EB5</password><txn>1387964710</txn><status>60</status></ns2:updateBill></soap:Body></soap:Envelope>########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


########### 25-12-2013 13:16 ###########
########################################


