system/logs/payments/QW-07032014.log

########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:updateBill xmlns:ns2="http://client.ishop.mw.ru/"><login>16801</login><password>67072E8E584261FD07FE0BDA79E59D06</password><txn>1394188099</txn><status>60</status></ns2:updateBill></soap:Body></soap:Envelope>########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


########### 07-03-2014 15:25 ###########
########################################


